0Bu/tesla-key-esp32/main/ota_update.cpp
#include "ota_update.hpp"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#include <esp_log.h>
#include <esp_system.h>
#include <esp_app_desc.h>
#include <esp_http_client.h>
#include <esp_https_ota.h>
#include <esp_ota_ops.h>
#include <esp_crt_bundle.h>
#include <cJSON.h>

#include "platform.hpp"
#include "task_config.hpp"
#include "rtos_guard.hpp"

#include <atomic>
#include <cstdio>
#include <cstring>
#include <exception>
#include <memory>
#include <string_view>

static const char* TAG = "ota";

// One atomic owner word closes both halves of the OTA/identity TOCTOU window. A separate
// `s_running` boolean can answer status questions, but cannot serialize "checked false, then OTA
// started". Every OTA worker owns Ota from before task creation until it exits/reboots; every
// key/VIN transaction owns IdentityMutation for its complete journal + NVS mutation lifetime.
static std::atomic<tk::OtaIdentityGateState> s_operation_gate{
    tk::OtaIdentityGateState::Idle};

static bool try_begin_ota_operation() {
    auto expected = s_operation_gate.load(std::memory_order_acquire);
    if (!tk::ota_operation_may_start(expected)) return false;
    return s_operation_gate.compare_exchange_strong(
        expected, tk::OtaIdentityGateState::Ota,
        std::memory_order_acq_rel, std::memory_order_acquire);
}

static void finish_operation(tk::OtaIdentityGateState owner) {
    auto expected = owner;
    if (!s_operation_gate.compare_exchange_strong(
            expected, tk::OtaIdentityGateState::Idle,
            std::memory_order_acq_rel, std::memory_order_acquire)) {
        // Never clear a different owner's gate: doing so would turn an invariant violation into
        // permission for a real overlapping reboot/mutation. Leave it fail-closed and diagnose.
        ESP_LOGE(TAG, "OTA/identity operation gate owner mismatch (expected=%d, actual=%d)",
                 static_cast<int>(owner), static_cast<int>(expected));
    }
}

tk::OtaVerificationState ota_verification_state() {
    const esp_partition_t* running = esp_ota_get_running_partition();
    if (!running) return tk::OtaVerificationState::Unknown;

    esp_ota_img_states_t state{};
    if (esp_ota_get_state_partition(running, &state) != ESP_OK)
        return tk::OtaVerificationState::Unknown;
    switch (state) {
        case ESP_OTA_IMG_UNDEFINED:
        case ESP_OTA_IMG_VALID:
            return tk::OtaVerificationState::Stable;
        case ESP_OTA_IMG_NEW:
        case ESP_OTA_IMG_PENDING_VERIFY:
            return tk::OtaVerificationState::PendingVerify;
        default:
            // INVALID/ABORTED cannot normally be the running partition. If storage reports such
            // a state, it is not authority to begin an irreversible cross-version identity write.
            return tk::OtaVerificationState::Unknown;
    }
}

bool ota_identity_mutation_allowed(tk::IdentityMutationEntry entry) {
    return tk::identity_mutation_may_start(
        ota_verification_state(),
        s_operation_gate.load(std::memory_order_acquire), entry);
}

OtaIdentityMutationGuard::OtaIdentityMutationGuard(tk::IdentityMutationEntry entry) {
    const tk::OtaVerificationState before = ota_verification_state();
    auto expected = s_operation_gate.load(std::memory_order_acquire);
    if (!tk::identity_mutation_may_start(before, expected, entry)) return;
    if (!s_operation_gate.compare_exchange_strong(
            expected, tk::OtaIdentityGateState::IdentityMutation,
            std::memory_order_acq_rel, std::memory_order_acquire)) {
        return;
    }

    // Re-sample after acquiring exclusivity. An OTA start racing the first sample either won the
    // CAS (so we never get here) or is now blocked. Any other state change/error remains
    // non-authoritative and releases the gate without permitting a write.
    if (!tk::identity_mutation_allowed(ota_verification_state(), entry)) {
        finish_operation(tk::OtaIdentityGateState::IdentityMutation);
        return;
    }
    held_ = true;
}

OtaIdentityMutationGuard::~OtaIdentityMutationGuard() {
    if (held_) finish_operation(tk::OtaIdentityGateState::IdentityMutation);
}

// Confirm a still-unverified OTA image before a deliberate reboot — see the header. Mirrors the
// mark-valid path in main.cpp's ota_health_gate_task, but fires immediately (the user interacting is
// the health signal) so an intentional restart within the health window doesn't trigger a rollback.
void ota_confirm_pending_image(tk::OtaRebootClass reboot_class) {
    if (!tk::ota_reboot_confirms_pending_image(reboot_class)) {
        ESP_LOGE(TAG, "refusing OTA confirmation for non-user recovery reboot class %d",
                 static_cast<int>(reboot_class));
        return;
    }
    const esp_partition_t* running = esp_ota_get_running_partition();
    esp_ota_img_states_t st;
    if (esp_ota_get_state_partition(running, &st) == ESP_OK &&
        st == ESP_OTA_IMG_PENDING_VERIFY) {
        if (esp_ota_mark_app_valid_cancel_rollback() == ESP_OK)
            ESP_LOGI(TAG, "OTA image confirmed valid before a user-initiated reboot (rollback cancelled)");
    }
}

// Short per-target image suffix so "esp32" appears only once in the OTA filename: esp32 ->
// "" (tesla-key-esp32.bin), esp32s3 -> "-s3", esp32c3 -> "-c3", esp32c6 -> "-c6".
// Must stay in lockstep with image_suffix() in scripts/ci-build-all.sh + build-pages.sh
// (which name the published asset the device pulls) — a mismatch 404s every OTA download.
// Kept as a string-literal macro because the download URL is assembled by compile-time
// concatenation below; the static_assert ties it to the host-tested tk::image_suffix()
// so the macro and the pure mapping can never drift.
#if   defined(CONFIG_IDF_TARGET_ESP32)
#  define TESLA_OTA_IMG_SUFFIX ""
#elif defined(CONFIG_IDF_TARGET_ESP32S3)
#  define TESLA_OTA_IMG_SUFFIX "-s3"
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#  define TESLA_OTA_IMG_SUFFIX "-c3"
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
#  define TESLA_OTA_IMG_SUFFIX "-c6"
#else
#  error "Unsupported CONFIG_IDF_TARGET for OTA image naming"
#endif
static_assert(std::string_view{TESLA_OTA_IMG_SUFFIX} == tk::image_suffix(TK_TARGET),
              "OTA image suffix macro drifted from tk::image_suffix()");

// ─── Shared status (written by the OTA task, read by HTTP handlers) ────────────

static std::atomic<SemaphoreHandle_t> s_lock{nullptr};
static OtaStatus                     s_status = { OtaState::Idle, 0, "idle", "", false, "" };
static std::atomic<bool>             s_running{false};    // a check or download task is active

static SemaphoreHandle_t ensure_lock() {
    SemaphoreHandle_t lock = s_lock.load(std::memory_order_acquire);
    if (lock) return lock;

    SemaphoreHandle_t candidate = xSemaphoreCreateMutex();
    if (!candidate) return nullptr;
    if (!s_lock.compare_exchange_strong(lock, candidate,
                                        std::memory_order_release,
                                        std::memory_order_acquire)) {
        vSemaphoreDelete(candidate);
        return lock;
    }
    return candidate;
}

// The status fields are std::string, so every assignment/copy below can throw bad_alloc on a
// fragmented heap. RAII (tk::SemGuard) releases s_lock during unwinding, so a throw here can't
// wedge the lock and freeze /ota/status for the rest of the boot.
static void set_state(OtaState st, int pct, const char* msg) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status.state    = st;
    s_status.progress = pct;
    s_status.message  = msg ? msg : "";
}

static void set_available(const char* ver) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);
    if (!g) return;
    s_status.available = ver ? ver : "";
}

OtaStatus ota_get_status() {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return s_status;
    tk::SemGuard g(lock);
    if (!g) return s_status;   // best-effort read if the lock never allocated
    return s_status;
}

bool ota_is_busy() {
    return s_running.load(std::memory_order_acquire) ||
           s_operation_gate.load(std::memory_order_acquire) ==
               tk::OtaIdentityGateState::Ota;
}

// ─── Version comparison (semver-ish "x.y.z") ───────────────────────────────────

static void parse_ver(const char* s, int v[3]) {
    v[0] = v[1] = v[2] = 0;
    if (s) sscanf(s, "%d.%d.%d", &v[0], &v[1], &v[2]);
}

// true if version a is strictly newer than b
static bool ver_newer(const char* a, const char* b) {
    int va[3], vb[3];
    parse_ver(a, va);
    parse_ver(b, vb);
    for (int i = 0; i < 3; ++i) {
        if (va[i] != vb[i]) return va[i] > vb[i];
    }
    return false;
}

static const char* running_version() {
    return esp_app_get_description()->version;
}

// ─── Small HTTPS GET into a buffer (for the tiny manifest.json) ─────────────────

static bool http_get_to_buffer(const char* url, std::string& out) {
    esp_http_client_config_t cfg = {};
    cfg.url               = url;
    cfg.crt_bundle_attach = esp_crt_bundle_attach;   // verify against bundled CA roots
    cfg.timeout_ms        = 10000;

    esp_http_client_handle_t c = esp_http_client_init(&cfg);
    if (!c) return false;
    struct HttpClientGuard {
        esp_http_client_handle_t handle;
        ~HttpClientGuard() {
            esp_http_client_close(handle);
            esp_http_client_cleanup(handle);
        }
    } client_guard{c};

    bool ok = false;
    if (esp_http_client_open(c, 0) == ESP_OK) {
        esp_http_client_fetch_headers(c);
        int status = esp_http_client_get_status_code(c);
        if (status == 200) {
            char buf[512];
            int  r;
            out.clear();
            while ((r = esp_http_client_read(c, buf, sizeof(buf))) > 0) {
                out.append(buf, r);
                if (out.size() > 8192) break;   // manifest is tiny; bound the read
            }
            ok = !out.empty();
        } else {
            ESP_LOGW(TAG, "manifest HTTP status %d", status);
        }
    } else {
        ESP_LOGW(TAG, "manifest connection failed");
    }

    return ok;
}

// ─── Check for a newer release ──────────────────────────────────────────────────

OtaCheckResult ota_check() {
    OtaCheckResult res{};
    res.current = running_version();

    set_state(OtaState::Checking, 0, "checking for updates");
    ESP_LOGI(TAG, "checking %s (running %s)", CONFIG_TESLA_OTA_MANIFEST_URL, res.current.c_str());

    std::string body;
    if (!http_get_to_buffer(CONFIG_TESLA_OTA_MANIFEST_URL, body)) {
        res.ok     = false;
        res.reason = "could not reach update server";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }

    std::unique_ptr<cJSON, decltype(&cJSON_Delete)> j(cJSON_Parse(body.c_str()), cJSON_Delete);
    cJSON* v = j ? cJSON_GetObjectItemCaseSensitive(j.get(), "version") : nullptr;
    if (cJSON_IsString(v) && v->valuestring) res.available = v->valuestring;

    if (res.available.empty()) {
        res.ok     = false;
        res.reason = "no version in manifest";
        set_state(OtaState::Idle, 0, "check failed");
        return res;
    }

    res.ok               = true;
    res.update_available = ver_newer(res.available.c_str(), res.current.c_str());
    res.reason           = res.update_available ? "update available" : "up to date";
    set_available(res.available.c_str());
    set_state(OtaState::Idle, 0, res.reason.c_str());
    ESP_LOGI(TAG, "available %s — %s", res.available.c_str(), res.reason.c_str());
    return res;
}

// Publish a finished check into the shared status for /ota/status polling.
static void set_check_done(const OtaCheckResult& r) {
    SemaphoreHandle_t lock = ensure_lock();
    if (!lock) return;
    tk::SemGuard g(lock);   // RAII: the std::string assigns below can throw
    if (!g) return;
    s_status.state            = r.ok ? OtaState::Idle : OtaState::Error;
    s_status.progress         = 0;
    s_status.message          = r.reason;
    s_status.available        = r.available;
    s_status.update_available = r.update_available;
    s_status.current          = r.current;
}

static void ota_check_task(void*) {
    // A one-shot job: contain any throw (http_get_to_buffer's std::string appends, cJSON, the
    // status std::string ops can all bad_alloc) as a terminal Error state — NEVER let it unwind
    // into the FreeRTOS C trampoline and reboot the device mid-check (issue #204).
    try {
        OtaCheckResult r = ota_check();   // blocking HTTPS GET, runs off the HTTP task
        set_check_done(r);
    } catch (const std::exception& e) {
        ESP_LOGE(TAG, "OTA check task exception: %s", e.what());
        try { set_state(OtaState::Error, 0, "update check ran out of resources"); } catch (...) {}
    } catch (...) {
        ESP_LOGE(TAG, "OTA check task unknown exception");
        try { set_state(OtaState::Error, 0, "update check failed unexpectedly"); } catch (...) {}
    }
    s_running.store(false, std::memory_order_release);
    finish_operation(tk::OtaIdentityGateState::Ota);
    vTaskDelete(nullptr);
}

bool ota_check_start() {
    if (!ensure_lock()) return false;
    // Acquire the cross-domain gate before publishing/starting the worker. This atomically loses
    // to an in-flight key/VIN transaction instead of sampling a separate busy flag and racing it.
    if (!try_begin_ota_operation()) return false;
    if (s_running.exchange(true, std::memory_order_acq_rel)) {
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }
    try {
        set_state(OtaState::Checking, 0, "checking for updates");
    } catch (...) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }

    // mbedTLS handshake + manifest fetch run here; same generous stack as ota_task.
    if (xTaskCreate(ota_check_task, "ota_chk", 8192, nullptr, tk::kPrioOtaCheck, nullptr) != pdPASS) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        try { set_state(OtaState::Error, 0, "could not start check task"); } catch (...) {}
        return false;
    }
    return true;
}

// ─── Background download + install ──────────────────────────────────────────────

static void ota_task_impl() {
    // Re-fetch the manifest HERE rather than trusting whatever a previous /ota/check left in the
    // shared status. Two independent reasons: POST /ota/update is reachable on its own, so gating
    // only inside the check would mean no gate at all for a direct caller; and the manifest could
    // have moved between the check and the confirmation. Costs one small HTTPS GET on this task —
    // never on a request path.
    const OtaCheckResult pre = ota_check();
    if (!pre.ok) {
        ESP_LOGE(TAG, "OTA refused: %s", pre.reason.c_str());
        set_state(OtaState::Error, 0, pre.reason.c_str());
        return;
    }
    if (!pre.update_available) {
        ESP_LOGW(TAG, "OTA refused: manifest %s is not newer than running %s",
                 pre.available.c_str(), pre.current.c_str());
        set_state(OtaState::Error, 0, "no newer version available");
        return;
    }

    // One channel, per-target image: base URL + this chip's short image suffix. The literals
    // concatenate at compile time (TESLA_OTA_IMG_SUFFIX is a string literal), so this is a
    // fixed string with no allocation. esp_https_ota also verifies the image chip-id, so a
    // wrong-target image (e.g. an esp32s3 build pulled by an esp32) is refused, not flashed.
    static constexpr const char* kFwUrl =
        CONFIG_TESLA_OTA_FIRMWARE_BASE_URL "tesla-key-esp32" TESLA_OTA_IMG_SUFFIX ".bin";
    ESP_LOGI(TAG, "OTA starting from %s (free heap %u)",
             kFwUrl, (unsigned)esp_get_free_heap_size());

    esp_http_client_config_t http_cfg = {};
    http_cfg.url               = kFwUrl;
    http_cfg.crt_bundle_attach = esp_crt_bundle_attach;
    http_cfg.timeout_ms        = 20000;
    http_cfg.keep_alive_enable = true;

    esp_https_ota_config_t ota_cfg = {};
    ota_cfg.http_config = &http_cfg;

    esp_https_ota_handle_t handle = nullptr;
    esp_err_t err = esp_https_ota_begin(&ota_cfg, &handle);
    if (err != ESP_OK || handle == nullptr) {
        ESP_LOGE(TAG, "esp_https_ota_begin failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "could not start download (server/TLS)");
        return;
    }
    struct OtaHandleGuard {
        esp_https_ota_handle_t handle;
        ~OtaHandleGuard() { if (handle) esp_https_ota_abort(handle); }
        esp_https_ota_handle_t release() {
            auto h = handle;
            handle = nullptr;
            return h;
        }
    } handle_guard{handle};

    int image_size = esp_https_ota_get_image_size(handle);

    // Downgrade defense (software anti-rollback, no eFuses burned by design). The image is
    // RSA-signed and esp_https_ota verifies that, but a signature only proves AUTHENTICITY,
    // not FRESHNESS: an attacker controlling the update host could serve an OLD, legitimately
    // signed image carrying a since-patched vulnerability. Read the version straight from the
    // downloaded image's own app descriptor (esp_https_ota_get_img_desc parses only the header,
    // before the bulk download) and refuse anything not strictly newer than what is running.
    // Checking the image itself — not the manifest — also closes the gap where a hostile host
    // advertises a new version in manifest.json but serves an old .bin under the image URL.
    esp_app_desc_t new_app{};
    err = esp_https_ota_get_img_desc(handle, &new_app);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_https_ota_get_img_desc failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "could not read image header");
        return;
    }
    if (!ver_newer(new_app.version, running_version())) {
        ESP_LOGW(TAG, "OTA refused: image %s not newer than running %s (downgrade blocked)",
                 new_app.version, running_version());
        set_state(OtaState::Error, 0, "no newer version available");
        return;
    }

    // SECOND point of the gate: the manifest and the image must name the SAME version.
    //
    // The freshness check above is necessary but not sufficient, and the gap is easy to miss: the
    // manifest and the .bin are two separately-controlled artifacts. A host serving manifest 1.9.0
    // beside a 1.8.0 image passes every check individually — the image is signed, and 1.8.0 really
    // is newer than a device running 1.7.0 — so the device installs a build the operator never
    // published, while the UI reports the version the manifest claimed. Requiring the two strings
    // to match exactly turns "the newest thing the host is willing to serve" back into "the build
    // the release actually is". Also catches the ordinary, far more likely case: a publish that
    // wrote a new manifest beside a stale image.
    if (pre.available != new_app.version) {
        ESP_LOGE(TAG, "OTA refused: manifest advertises %s but the image is %s — the manifest and "
                      "the image disagree, so neither can be trusted to be the published release",
                 pre.available.c_str(), new_app.version);
        set_state(OtaState::Error, 0, "manifest and image versions disagree");
        return;
    }
    ESP_LOGI(TAG, "OTA image %s newer than running %s and matches the manifest — proceeding",
             new_app.version, running_version());

    while (true) {
        err = esp_https_ota_perform(handle);
        if (err != ESP_ERR_HTTPS_OTA_IN_PROGRESS) break;
        int read = esp_https_ota_get_image_len_read(handle);
        int pct  = (image_size > 0) ? (int)((int64_t)read * 100 / image_size) : 0;
        set_state(OtaState::Downloading, pct, "downloading");
    }

    if (err == ESP_OK && esp_https_ota_is_complete_data_received(handle)) {
        err = esp_https_ota_finish(handle_guard.release());
        if (err == ESP_OK) {
            ESP_LOGI(TAG, "OTA complete — rebooting into new image");
            set_state(OtaState::Done, 100, "update complete — rebooting");
            vTaskDelay(pdMS_TO_TICKS(1200));
            esp_restart();   // does not return
        }
        ESP_LOGE(TAG, "esp_https_ota_finish failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0,
                  err == ESP_ERR_OTA_VALIDATE_FAILED ? "downloaded image is invalid"
                                                     : "could not finalize update");
    } else {
        ESP_LOGE(TAG, "OTA download failed: %s", esp_err_to_name(err));
        set_state(OtaState::Error, 0, "download failed");
    }
}

static void ota_task(void*) {
    try {
        ota_task_impl();
    } catch (const std::exception& e) {
        ESP_LOGE(TAG, "OTA task exception: %s", e.what());
        try { set_state(OtaState::Error, 0, "update ran out of resources"); } catch (...) {}
    } catch (...) {
        ESP_LOGE(TAG, "OTA task unknown exception");
        try { set_state(OtaState::Error, 0, "update failed unexpectedly"); } catch (...) {}
    }
    s_running.store(false, std::memory_order_release);
    finish_operation(tk::OtaIdentityGateState::Ota);
    vTaskDelete(nullptr);
}

bool ota_start() {
    if (!ensure_lock()) return false;
    // The same owner word excludes both a second OTA and every identity transaction. On a
    // successful install it remains owned until esp_restart(); on every returning path the task
    // releases it below.
    if (!try_begin_ota_operation()) return false;
    if (s_running.exchange(true, std::memory_order_acq_rel)) {
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }
    try {
        set_state(OtaState::Downloading, 0, "starting download");
    } catch (...) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        return false;
    }

    // A generous stack: mbedTLS record processing + esp_https_ota run here.
    if (xTaskCreate(ota_task, "ota", 8192, nullptr, tk::kPrioOta, nullptr) != pdPASS) {
        s_running.store(false, std::memory_order_release);
        finish_operation(tk::OtaIdentityGateState::Ota);
        try { set_state(OtaState::Error, 0, "could not start OTA task"); } catch (...) {}
        return false;
    }
    return true;
}
